Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.autoTidy.threshold.hintFormat
source: Tags with confidence below %@ will not be applied automatically.
ar: الوسوم ذات الثقة الأقل من %@ لن يتم تطبيقها تلقائيًا.
de: Tags mit einer Konfidenz unter %@ werden nicht automatisch angewendet.
es: Las etiquetas con confianza inferior a %@ no se aplicarán automáticamente.
fr: Les étiquettes avec une confiance inférieure à %@ ne seront pas appliquées automatiquement.
id: Tag dengan kepercayaan di bawah %@ tidak akan diterapkan secara otomatis.
it: I tag con confidenza inferiore a %@ non verranno applicati automaticamente.
ja: 信頼度が%@未満のタグは自動適用されません。
ko: %@ 미만의 신뢰도를 가진 태그는 자동으로 적용되지 않습니다.
nl: Tags met een vertrouwen onder %@ worden niet automatisch toegepast.
pl: Tagi z pewnością poniżej %@ nie zostaną zastosowane automatycznie.
pt_br: Tags com confiança abaixo de %@ não serão aplicadas automaticamente.
ru: Теги с уверенностью ниже %@ не будут применяться автоматически.
tr: Güveni %@'nin altında olan etiketler otomatik olarak uygulanmaz.
uk: Теги з впевненістю нижче %@ не будуть застосовані автоматично.
vi: Các thẻ có độ tin cậy dưới %@ sẽ không được tự động áp dụng.
zh_hans: 置信度低于 %@ 的标签不会被自动应用。
zh_hant: 置信度低于 %@ 的标签不会被自动应用。

# settings.autoTidy.threshold.label
source: Confidence threshold
ar: عتبة الثقة
de: Konfidenzschwellenwert
es: Umbral de confianza
fr: Seuil de confiance
id: Ambang kepercayaan
it: Soglia di confidenza
ja: 信頼度しきい値
ko: 신뢰도 임계값
nl: Vertrouwensdrempel
pl: Próg pewności
pt_br: Limiar de confiança
ru: Порог уверенности
tr: Güven eşiği
uk: Поріг впевненості
vi: Ngưỡng độ tin cậy
zh_hans: 置信度阈值
zh_hant: 置信度阈值

# settings.autoTidy.trigger.onLaunch
source: Run after launch
ar: تشغيل بعد الإطلاق
de: Nach dem Start ausführen
es: Ejecutar tras el inicio
fr: Exécuter après le lancement
id: Jalankan setelah peluncuran
it: Esegui dopo l'avvio
ja: 起動後に実行
ko: 실행 후 실행
nl: Uitvoeren na opstarten
pl: Uruchom po uruchomieniu
pt_br: Executar após o lançamento
ru: Запускать после запуска
tr: Başlangıçtan sonra çalıştır
uk: Запускати після запуску
vi: Chạy sau khi khởi động
zh_hans: 启动后整理
zh_hant: 启动后整理

# settings.autoTidy.trigger.onLaunch.description
source: After the app launches, wait 60 seconds and tidy one batch of untagged stars.
ar: بعد إطلاق التطبيق، انتظر 60 ثانية وقم بترتيب دُفعة واحدة من النجوم غير الموسومة.
de: Nach dem App-Start 60 Sekunden warten und einen Batch unmarkierter Sterne aufräumen.
es: Después de que la app se inicie, espera 60 segundos y ordena un lote de destacados sin etiquetar.
fr: Après le lancement de l'application, attendre 60 secondes et trier un lot d'étoiles non étiquetées.
id: Setelah aplikasi diluncurkan, tunggu 60 detik dan rapikan satu batch bintang tanpa tag.
it: Dopo l'avvio dell'app, attendi 60 secondi e ordina un batch di stelle senza tag.
ja: アプリ起動後、60秒待機してタグなしスターの1バッチを整理します。
ko: 앱 실행 후 60초를 기다린 후 태그되지 않은 별표 한 배치를 정리합니다.
nl: Wacht na het starten van de app 60 seconden en ruim één batch ongetagde sterren op.
pl: Po uruchomieniu aplikacji odczekaj 60 sekund i uporządkuj jedną partię nieotagowanych gwiazdek.
pt_br: Após o aplicativo iniciar, aguarda 60 segundos e organiza um lote de estrelas sem tags.
ru: После запуска приложения подождать 60 секунд и обработать один пакет неотмеченных звёзд.
tr: Uygulama başlatıldıktan sonra 60 saniye bekleyin ve bir grup etiketlenmemiş yıldızı düzenleyin.
uk: Після запуску програми зачекайте 60 секунд і впорядкуйте один пакет не позначених тегами зірок.
vi: Sau khi ứng dụng khởi động, chờ 60 giây và dọn dẹp một lô các sao chưa gắn thẻ.
zh_hans: 应用启动 60 秒后，自动整理一轮未分类 Star。
zh_hant: 应用启动 60 秒后，自动整理一轮未分类 Star。

# settings.autoTidy.trigger.onSync
source: Run after sync
ar: تشغيل بعد المزامنة
de: Nach Synchronisation ausführen
es: Ejecutar tras la sincronización
fr: Exécuter après la synchronisation
id: Jalankan setelah sinkronisasi
it: Esegui dopo la sincronizzazione
ja: 同期後に実行
ko: 동기화 후 실행
nl: Uitvoeren na synchronisatie
pl: Uruchom po synchronizacji
pt_br: Executar após a sincronização
ru: Запускать после синхронизации
tr: Senkronizasyondan sonra çalıştır
uk: Запускати після синхронізації
vi: Chạy sau khi đồng bộ
zh_hans: 同步后整理
zh_hant: 同步后整理

# settings.autoTidy.trigger.onSync.description
source: After star sync finishes, tidy currently untagged stars.
ar: بعد اكتمال مزامنة النجوم، قم بترتيب النجوم غير الموسومة حاليًا.
de: Nach Abschluss der Sternsynchronisation aktuell unmarkierte Sterne aufräumen.
es: Después de que finalice la sincronización de destacados, ordena los destacados actualmente sin etiquetar.
fr: Après la fin de la synchronisation des étoiles, trier les étoiles actuellement non étiquetées.
id: Setelah sinkronisasi bintang selesai, rapikan bintang yang saat ini tanpa tag.
it: Dopo il completamento della sincronizzazione delle stelle, ordina le stelle attualmente senza tag.
ja: スターの同期完了後、現在タグ付けされていないスターを整理します。
ko: 별표 동기화가 완료된 후 현재 태그되지 않은 별표를 정리합니다.
nl: Ruim na het voltooien van de stersynchronisatie de momenteel ongetagde sterren op.
pl: Po zakończeniu synchronizacji gwiazdek uporządkuj obecnie nieotagowane gwiazdki.
pt_br: Após a sincronização de estrelas terminar, organiza as estrelas atualmente sem tags.
ru: После завершения синхронизации звёзд обработать неотмеченные звёзды.
tr: Yıldız senkronizasyonu bittikten sonra, şu anda etiketlenmemiş yıldızları düzenleyin.
uk: Після завершення синхронізації зірок впорядкуйте поточні не позначені тегами зірки.
vi: Sau khi đồng bộ sao hoàn tất, dọn dẹp các sao hiện chưa gắn thẻ.
zh_hans: Star 同步完成后，自动整理当前未分类的 Star。
zh_hant: Star 同步完成后，自动整理当前未分类的 Star。

# settings.autoTidy.trigger.scheduled
source: Run on schedule
ar: تشغيل وفق جدول
de: Nach Zeitplan ausführen
es: Ejecutar según horario
fr: Exécuter selon un planning
id: Jalankan sesuai jadwal
it: Esegui secondo pianificazione
ja: スケジュール実行
ko: 예약 실행
nl: Uitvoeren op schema
pl: Uruchom według harmonogramu
pt_br: Executar conforme agendamento
ru: Запускать по расписанию
tr: Zamanlanmış çalıştır
uk: За розкладом
vi: Chạy theo lịch
zh_hans: 定时执行
zh_hant: 定时执行

# settings.autoTidy.trigger.scheduledInterval
source: Interval
ar: الفاصل الزمني
de: Intervall
es: Intervalo
fr: Intervalle
it: Intervallo
ja: 間隔
ko: 간격
pl: Interwał
pt_br: Intervalo
ru: Интервал
tr: Aralık
uk: Інтервал
vi: Khoảng thời gian
zh_hans: 间隔
zh_hant: 间隔

# settings.autoTidy.trigger.scheduledInterval.description
source: How often scheduled tidy runs, in hours (1–24).
ar: عدد مرات تشغيل الترتيب المجدول، بالساعات (1–24).
de: Wie oft die geplante Bereinigung läuft, in Stunden (1–24).
es: Frecuencia con la que se ejecuta la limpieza programada, en horas (1–24).
fr: Fréquence d'exécution planifiée, en heures (1–24).
id: Seberapa sering pembersihan terjadwal berjalan, dalam jam (1–24).
it: Frequenza con cui viene eseguita la pulizia pianificata, in ore (1–24).
ja: スケジュールされた整理の実行間隔（時間、1～24）。
ko: 예약 정리 실행 간격(시간, 1–24).
nl: Hoe vaak het geplande opruimen wordt uitgevoerd, in uren (1–24).
pl: Jak często uruchamiać zaplanowane porządkowanie, w godzinach (1–24).
pt_br: Frequência da organização agendada, em horas (1–24).
ru: Как часто выполняется плановая очистка, в часах (1–24).
tr: Zamanlanmış temizliğin ne sıklıkta çalışacağı, saat cinsinden (1–24).
uk: Як часто виконується планове прибирання, у годинах (1–24).
vi: Tần suất chạy dọn dẹp theo lịch, tính bằng giờ (1–24).
zh_hans: 定时执行的间隔，单位为小时，范围 1–24。
zh_hant: 定时执行的间隔，单位为小时，范围 1–24。

# settings.autoTidy.triggerNow
source: Run once now
ar: تشغيل مرة واحدة الآن
de: Jetzt einmal ausführen
es: Ejecutar una vez ahora
fr: Exécuter une fois maintenant
id: Jalankan sekali sekarang
it: Esegui una volta ora
ja: 今すぐ1回実行
ko: 지금 한 번 실행
nl: Nu eenmalig uitvoeren
pl: Uruchom raz teraz
pt_br: Executar uma vez agora
ru: Запустить один раз сейчас
tr: Şimdi bir kez çalıştır
uk: Виконати один раз зараз
vi: Chạy một lần ngay
zh_hans: 立刻手动触发一次
zh_hant: 立刻手动触发一次

# settings.autoTidy.triggers.label
source: TRIGGERS
ar: المشغلات
de: AUSLÖSER
es: ACTIVADORES
fr: DÉCLENCHEURS
id: PEMICU
it: ATTIVATORI
ja: トリガー
ko: 트리거
pl: WYZWALACZE
pt_br: GATILHOS
ru: ТРИГГЕРЫ
tr: TETİKLEYİCİLER
uk: ТРИГЕРИ
vi: TRIGGER
zh_hans: 触发时机
zh_hant: 触发时机

# settings.common.cancel
source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
id: Batal
it: Annulla
ja: キャンセル
ko: 취소
nl: Annuleer
pl: Anuluj
pt_br: Cancelar
ru: Отмена
tr: İptal
uk: Скасувати
vi: Hủy
zh_hans: 取消
zh_hant: 取消

# settings.diagnostics.export.description
source: Export recent diagnostics to a local zip.
ar: تصدير التشخيصات الحديثة إلى ملف مضغوط محلي.
de: Aktuelle Diagnosedaten in ein lokales ZIP exportieren.
es: Exportar diagnósticos recientes a un archivo zip local.
fr: Exporter les diagnostics récents dans un fichier zip local.
id: Ekspor diagnostik terbaru ke file zip lokal.
it: Esporta le diagnostiche recenti in un file zip locale.
ja: 最近の診断情報をローカルのzipファイルにエクスポートします。
ko: 최근 진단 정보를 로컬 zip 파일로 내보냅니다.
nl: Exporteer recente diagnostiek naar een lokaal zip-bestand.
pl: Eksportuj ostatnie dane diagnostyczne do lokalnego archiwum zip.
pt_br: Exportar diagnósticos recentes para um zip local.
ru: Экспортировать последние диагностические данные в локальный zip-архив.
tr: Son tanılamaları yerel bir zip dosyasına dışa aktar.
uk: Експортувати останні діагностичні дані в локальний zip-файл.
vi: Xuất chẩn đoán gần đây ra tệp zip cục bộ.
zh_hans: 将最近诊断信息导出为本地 zip 包。
zh_hant: 将最近诊断信息导出为本地 zip 包。

# settings.diagnostics.export.running
source: Preparing diagnostic archive...
ar: جارٍ تحضير أرشيف التشخيص...
de: Diagnosearchiv wird vorbereitet …
es: Preparando archivo de diagnóstico...
fr: Préparation de l'archive de diagnostic...
id: Menyiapkan arsip diagnostik...
it: Preparazione archivio diagnostico...
ja: 診断アーカイブを準備中...
ko: 진단 아카이브 준비 중...
nl: Diagnostisch archief voorbereiden...
pl: Przygotowywanie archiwum diagnostycznego...
pt_br: Preparando arquivo de diagnóstico...
ru: Подготовка диагностического архива...
tr: Tanılama arşivi hazırlanıyor...
uk: Підготовка діагностичного архіву...
vi: Đang chuẩn bị lưu trữ chẩn đoán...
zh_hans: 正在准备诊断包…
zh_hant: 正在准备诊断包…

# settings.diagnostics.export.section
source: Export
ar: تصدير
es: Exportar
fr: Exportation
id: Ekspor
it: Esporta
ja: エクスポート
ko: 내보내기
nl: Exporteren
pl: Eksport
pt_br: Exportar
ru: Экспорт
tr: Dışa Aktar
uk: Експорт
vi: Xuất
zh_hans: 导出
zh_hant: 导出

# settings.diagnostics.export.successMessage
source: Exported debug logs, reset diagnostic status
ar: تم تصدير سجلات التصحيح، وتمت إعادة تعيين حالة التشخيص
de: Debug-Protokolle exportiert, Diagnosestatus zurückgesetzt
es: Registros de depuración exportados, estado de diagnóstico restablecido
fr: Journaux de débogage exportés, état de diagnostic réinitialisé
id: Log debug berhasil diekspor, status diagnostik direset
it: Log di debug esportati, stato diagnostico reimpostato
ja: デバッグログをエクスポートし、診断ステータスをリセットしました
ko: 디버그 로그 내보내기 완료, 진단 상태 재설정
nl: Debuglogboeken geëxporteerd, diagnostische status gereset
pl: Wyeksportowano dzienniki debugowania, zresetowano stan diagnostyki
pt_br: Logs de depuração exportados, status de diagnóstico redefinido
ru: Экспортированы журналы отладки, статус диагностики сброшен
tr: Hata ayıklama günlükleri dışa aktarıldı, tanılama durumu sıfırlandı
uk: Експортовано журнали налагодження, скинуто статус діагностики
vi: Đã xuất nhật ký gỡ lỗi, đặt lại trạng thái chẩn đoán
zh_hans: 已导出调试日志, 重置诊断状态
zh_hant: 已导出调试日志, 重置诊断状态

# settings.diagnostics.privacy.description
source: The archive is designed to exclude GitHub tokens, API keys, AI prompts, README bodies, and private notes. It may include service names, status codes, repository full names, local file paths, and error summaries.
ar: تم تصميم الأرشيف لاستبعاد رموز GitHub المميزة، ومفاتيح API، ومطالبات الذكاء الاصطناعي، ونصوص README، والملاحظات الخاصة. قد يتضمن أسماء الخدمات، ورموز الحالة، وأسماء المستودعات الكاملة، ومسارات الملفات المحلية، وملخصات الأخطاء.
de: Das Archiv wurde so konzipiert, dass es GitHub-Tokens, API-Schlüssel, KI-Eingabeaufforderungen, README-Inhalte und private Notizen ausschließt. Es kann Dienstnamen, Statuscodes, vollständige Repository-Namen, lokale Dateipfade und Fehlerzusammenfassungen enthalten.
es: El archivo está diseñado para excluir tokens de GitHub, claves API, indicaciones de IA, cuerpos de README y notas privadas. Puede incluir nombres de servicio, códigos de estado, nombres completos de repositorio, rutas de archivos locales y resúmenes de errores.
fr: L'archive est conçue pour exclure les jetons GitHub, les clés API, les invites IA, les contenus README et les notes privées. Elle peut inclure les noms de services, les codes d'état, les noms complets de dépôts, les chemins de fichiers locaux et les résumés d'erreurs.
id: Arsip dirancang untuk mengecualikan token GitHub, kunci API, prompt AI, isi README, dan catatan pribadi. Arsip mungkin menyertakan nama layanan, kode status, nama lengkap repositori, jalur file lokal, dan ringkasan kesalahan.
it: L'archivio è progettato per escludere token GitHub, chiavi API, prompt AI, corpi README e note private. Può includere nomi di servizi, codici di stato, nomi completi dei repository, percorsi di file locali e riepiloghi di errori.
ja: アーカイブはGitHubトークン、APIキー、AIプロンプト、README本文、プライベートノートを除外するように設計されています。サービス名、ステータスコード、リポジトリのフルネーム、ローカルファイルパス、エラー概要が含まれる場合があります。
ko: 아카이브는 GitHub 토큰, API 키, AI 프롬프트, README 본문, 개인 메모를 제외하도록 설계되었습니다. 서비스 이름, 상태 코드, 저장소 전체 이름, 로컬 파일 경로, 오류 요약이 포함될 수 있습니다.
nl: Het archief is ontworpen om GitHub-tokens, API-sleutels, AI-prompts, README-teksten en privénotities uit te sluiten. Het kan servicenamen, statuscodes, volledige repositorynamen, lokale bestandspaden en foutsamenvattingen bevatten.
pl: Archiwum zostało zaprojektowane tak, aby wykluczać tokeny GitHub, klucze API, podpowiedzi AI, treści README i prywatne notatki. Może zawierać nazwy usług, kody statusu, pełne nazwy repozytoriów, lokalne ścieżki plików i podsumowania błędów.
pt_br: O arquivo foi projetado para excluir tokens do GitHub, chaves de API, prompts de IA, corpos de README e notas privadas. Pode incluir nomes de serviços, códigos de status, nomes completos de repositórios, caminhos de arquivos locais e resumos de erros.
ru: Архив разработан так, чтобы исключить токены GitHub, ключи API, подсказки ИИ, содержимое README и личные заметки. Он может включать имена служб, коды состояния, полные имена репозиториев, локальные пути к файлам и сводки ошибок.
tr: Arşiv, GitHub token'ları, API anahtarları, AI istemleri, README içerikleri ve özel notları hariç tutacak şekilde tasarlanmıştır. Hizmet adları, durum kodları, depo tam adları, yerel dosya yolları ve hata özetlerini içerebilir.
uk: Архів розроблено так, щоб виключити токени GitHub, ключі API, підказки ШІ, тіла README та приватні нотатки. Він може містити назви служб, коди стану, повні назви репозиторіїв, локальні шляхи до файлів та підсумки помилок.
vi: Kho lưu trữ được thiết kế để loại trừ token GitHub, khóa API, lời nhắc AI, nội dung README và ghi chú riêng tư. Nó có thể bao gồm tên dịch vụ, mã trạng thái, tên đầy đủ của kho lưu trữ, đường dẫn tệp cục bộ và tóm tắt lỗi.
zh_hans: 诊断包设计上不包含 GitHub token、API Key、AI prompt、README 正文和私有笔记。它可能包含服务名、状态码、仓库 full name、本地文件路径和错误摘要。
zh_hant: 诊断包设计上不包含 GitHub token、API Key、AI prompt、README 正文和私有笔记。它可能包含服务名、状态码、仓库 full name、本地文件路径和错误摘要。

# settings.diagnostics.privacy.section
source: Privacy
ar: الخصوصية
de: Datenschutz
es: Privacidad
fr: Confidentialité
id: Privasi
ja: プライバシー
ko: 개인정보 보호
pl: Prywatność
pt_br: Privacidade
ru: Конфиденциальность
tr: Gizlilik
uk: Конфіденційність
vi: Quyền riêng tư
zh_hans: 隐私
zh_hant: 隐私

# settings.diagnostics.telemetry.enabled.help
source: Send allowlisted, anonymous product events and coarse performance buckets. Starcat never sends repository names, search text, notes, README bodies, prompts, responses, API keys, tokens, or local paths.
ar: إرسال أحداث منتج مجهولة المصدر ومدرجة في القائمة المسموح بها، ومجموعات تقريبية للأداء. لا يرسل Starcat أبدًا أسماء المستودعات، أو نصوص البحث، أو الملاحظات، أو نصوص README، أو المطالبات، أو الردود، أو مفاتيح API، أو الرموز المميزة، أو المسارات المحلية.
de: Senden Sie zugelassene, anonyme Produktereignisse und grobe Leistungsdaten. Starcat sendet niemals Repository-Namen, Suchtext, Notizen, README-Inhalte, Eingabeaufforderungen, Antworten, API-Schlüssel, Tokens oder lokale Pfade.
es: Enviar eventos de producto anónimos permitidos y métricas de rendimiento generales. Starcat nunca envía nombres de repositorio, texto de búsqueda, notas, cuerpos de README, indicaciones, respuestas, claves API, tokens ni rutas locales.
fr: Envoyer des événements produits anonymes autorisés et des catégories de performances générales. Starcat n'envoie jamais de noms de dépôts, de texte de recherche, de notes, de contenus README, d'invites, de réponses, de clés API, de jetons ou de chemins locaux.
id: Kirim peristiwa produk anonim yang diizinkan dan bucket kinerja kasar. Starcat tidak pernah mengirim nama repositori, teks pencarian, catatan, isi README, prompt, respons, kunci API, token, atau jalur lokal.
it: Invia eventi di prodotto anonimi consentiti e fasce di prestazioni approssimative. Starcat non invia mai nomi di repository, testo di ricerca, note, corpi README, prompt, risposte, chiavi API, token o percorsi locali.
ja: 許可リストに登録された匿名の製品イベントと大まかなパフォーマンスバケットを送信します。Starcatはリポジトリ名、検索テキスト、メモ、README本文、プロンプト、応答、APIキー、トークン、ローカルパスを送信しません。
ko: 허용 목록에 포함된 익명 제품 이벤트와 대략적인 성능 버킷을 전송합니다. Starcat는 저장소 이름, 검색 텍스트, 메모, README 본문, 프롬프트, 응답, API 키, 토큰, 로컬 경로를 절대 전송하지 않습니다.
nl: Stuur goedgekeurde, anonieme productgebeurtenissen en grove prestatiecategorieën. Starcat verzendt nooit repositorynamen, zoektekst, notities, README-teksten, prompts, antwoorden, API-sleutels, tokens of lokale paden.
pl: Wysyłaj dozwolone, anonimowe zdarzenia produktowe i ogólne dane o wydajności. Starcat nigdy nie wysyła nazw repozytoriów, tekstu wyszukiwania, notatek, treści README, podpowiedzi, odpowiedzi, kluczy API, tokenów ani lokalnych ścieżek.
pt_br: Envia eventos de produto anônimos e permitidos, além de faixas de desempenho gerais. O Starcat nunca envia nomes de repositórios, texto de pesquisa, notas, corpos de README, prompts, respostas, chaves de API, tokens ou caminhos locais.
ru: Отправлять разрешённые анонимные события продукта и общие показатели производительности. Starcat никогда не отправляет имена репозиториев, текст поиска, заметки, содержимое README, подсказки, ответы, ключи API, токены или локальные пути.
tr: İzin verilen, anonim ürün olaylarını ve kaba performans kovalarını gönderin. Starcat asla depo adları, arama metni, notlar, README içerikleri, istemler, yanıtlar, API anahtarları, token'lar veya yerel yollar göndermez.
uk: Надсилайте дозволені анонімні події продукту та загальні показники продуктивності. Starcat ніколи не надсилає назви репозиторіїв, текст пошуку, нотатки, тіла README, підказки, відповіді, ключі API, токени або локальні шляхи.
vi: Gửi các sự kiện sản phẩm ẩn danh được cho phép và các nhóm hiệu suất thô. Starcat không bao giờ gửi tên kho lưu trữ, văn bản tìm kiếm, ghi chú, nội dung README, lời nhắc, phản hồi, khóa API, token hoặc đường dẫn cục bộ.
zh_hans: 发送白名单内的匿名产品事件与粗粒度性能分桶。Starcat 不会发送仓库名、搜索词、笔记、README 正文、prompt、回复、API Key、token 或本地路径。
zh_hant: 发送白名单内的匿名产品事件与粗粒度性能分桶。Starcat 不会发送仓库名、搜索词、笔记、README 正文、prompt、回复、API Key、token 或本地路径。

# settings.diagnostics.telemetry.enabled.title
source: Share anonymous usage data and performance summaries
ar: مشاركة بيانات الاستخدام مجهولة المصدر وملخصات الأداء
de: Anonyme Nutzungsdaten und Leistungszusammenfassungen teilen
es: Compartir datos de uso anónimos y resúmenes de rendimiento
fr: Partager des données d'utilisation anonymes et des résumés de performances
id: Bagikan data penggunaan anonim dan ringkasan kinerja
it: Condividi dati di utilizzo anonimi e riepiloghi delle prestazioni
ja: 匿名の使用状況データとパフォーマンス概要を共有
ko: 익명 사용 데이터 및 성능 요약 공유
nl: Deel anonieme gebruiksgegevens en prestatiesamenvattingen
pl: Udostępniaj anonimowe dane o użytkowaniu i podsumowania wydajności
pt_br: Compartilhar dados de uso anônimos e resumos de desempenho
ru: Делиться анонимными данными об использовании и сводками производительности
tr: Anonim kullanım verilerini ve performans özetlerini paylaş
uk: Надсилати анонімні дані використання та підсумки продуктивності
vi: Chia sẻ dữ liệu sử dụng ẩn danh và tóm tắt hiệu suất
zh_hans: 允许发送匿名使用数据与性能摘要
zh_hant: 允许发送匿名使用数据与性能摘要

# settings.diagnostics.telemetry.privacy
source: MetricKit payloads are stored locally as diagnostic summaries in this version; they are not uploaded.
ar: يتم تخزين حمولات MetricKit محليًا كملخصات تشخيصية في هذا الإصدار؛ ولا يتم تحميلها.
de: MetricKit-Nutzlasten werden in dieser Version lokal als Diagnosezusammenfassungen gespeichert; sie werden nicht hochgeladen.
es: Las cargas de MetricKit se almacenan localmente como resúmenes de diagnóstico en esta versión; no se cargan.
fr: Les données MetricKit sont stockées localement sous forme de résumés de diagnostic dans cette version ; elles ne sont pas téléchargées.
id: Payload MetricKit disimpan secara lokal sebagai ringkasan diagnostik di versi ini; tidak diunggah.
it: I payload MetricKit vengono archiviati localmente come riepiloghi diagnostici in questa versione; non vengono caricati.
ja: MetricKitペイロードはこのバージョンでは診断サマリーとしてローカルに保存され、アップロードされません。
ko: MetricKit 페이로드는 이 버전에서 진단 요약으로 로컬에 저장되며 업로드되지 않습니다.
nl: MetricKit-payloads worden lokaal opgeslagen als diagnostische samenvattingen in deze versie; ze worden niet geüpload.
pl: Ładunki MetricKit są przechowywane lokalnie jako podsumowania diagnostyczne w tej wersji; nie są przesyłane.
pt_br: Os payloads do MetricKit são armazenados localmente como resumos de diagnóstico nesta versão; eles não são enviados.
ru: Полезные данные MetricKit хранятся локально в виде диагностических сводок в этой версии; они не загружаются.
tr: MetricKit yükleri bu sürümde tanılama özetleri olarak yerel olarak saklanır; yüklenmezler.
uk: У цій версії корисні навантаження MetricKit зберігаються локально як діагностичні підсумки; вони не завантажуються.
vi: Tải trọng MetricKit được lưu trữ cục bộ dưới dạng tóm tắt chẩn đoán trong phiên bản này; chúng không được tải lên.
zh_hans: 当前版本只把 MetricKit payload 记录为本地诊断摘要，不上传原始数据。
zh_hant: 当前版本只把 MetricKit payload 记录为本地诊断摘要，不上传原始数据。

# settings.diagnostics.telemetry.section
source: Anonymous Telemetry
ar: القياس عن بُعد مجهول المصدر
de: Anonyme Telemetrie
es: Telemetría anónima
fr: Télémétrie anonyme
id: Telemetri Anonim
it: Telemetria Anonima
ja: 匿名テレメトリ
ko: 익명 원격 측정
nl: Anonieme Telemetrie
pl: Anonimowa telemetria
pt_br: Telemetria Anônima
ru: Анонимная телеметрия
tr: Anonim Telemetri
uk: Анонімна телеметрія
vi: Đo lường ẩn danh
zh_hans: 匿名遥测
zh_hant: 匿名遥测

# settings.diagnostics.title
source: Diagnostics
ar: التشخيص
de: Diagnose
es: Diagnósticos
id: Diagnostik
it: Diagnostica
ja: 診断
ko: 진단
nl: Diagnostiek
pl: Diagnostyka
pt_br: Diagnósticos
ru: Диагностика
tr: Tanılama
uk: Діагностика
vi: Chẩn đoán
zh_hans: 诊断
zh_hant: 诊断

# settings.externalSearch.aggregate
source: Aggregate external context search
ar: تجميع البحث الخارجي للسياق
de: Aggregierte externe Kontextsuche
es: Búsqueda agregada de contexto externo
fr: Recherche de contexte externe agrégée
id: Agregat pencarian konteks eksternal
it: Ricerca aggregata del contesto esterno
ja: 外部コンテキスト検索を集約
ko: 외부 컨텍스트 검색 통합
nl: Geaggregeerd extern contextzoeken
pl: Agreguj zewnętrzne wyszukiwanie kontekstu
pt_br: Agregar pesquisa de contexto externo
ru: Агрегировать внешний контекстный поиск
tr: Harici bağlam aramasını birleştir
uk: Агрегувати зовнішній контекстний пошук
vi: Tổng hợp tìm kiếm ngữ cảnh bên ngoài
zh_hans: 聚合搜索
zh_hant: 聚合搜索
